Swapped out ASCII diagram with mermaid
